app/views/carts/_cart.html.erb

<% unless cart.line_items.empty? %>
---
SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 17
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 3