app/controllers/carts_controller.rb

  def show
    begin
       @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1

  def edit
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-02-08 08:41:30', '2012-02-08 08:41:30')

  def update
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
DELETE FROM `carts` WHERE `carts`.`id` = 1