app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = -636584098 ORDER BY title LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-02-08 08:29:24', '2012-02-08 08:29:24')
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `quantity`, `updated_at`) VALUES (2, '2012-02-08 12:04:18', 2, 1, '2012-02-08 12:04:18')
UPDATE `line_items` SET `updated_at` = '2012-02-08 12:04:51', `quantity` = 2 WHERE `line_items`.`id` = 5
---
  def create
    @cart = current_cart
     product = Product.find(params[:product_id])
      @line_item = @cart.add_product(product.id)


    respond_to do |format|
      if @line_item.save

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy