app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY title LIMIT 1
---
 def show

    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` ORDER BY title
---
 def index

    @products = Product.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 ORDER BY title LIMIT 1
---
 def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2012-02-07 10:35:41', 'uo', 'uu', 6.0, 'ouo', '2012-02-07 10:35:41')
---
 def create

    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 ORDER BY title LIMIT 1
UPDATE `products` SET `title` = 'Ninja', `updated_at` = '2012-02-08 06:50:47', `description` = '250cc', `image_url` = '\'/images/ninja.jpg\'', `price` = 182000.0 WHERE `products`.`id` = 6
---
 def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 3
---
 def destroy
    @product = Product.find(params[:id])
    @product.destroy